import datetime
import random
import time
import bangla
import re
import cosineSimilarity
import numpy as np
import logic.NER as ln
import variables.Variables as v
import variables.ConstantVariable as cv
import logic.identifySymptom as ls
import classification.classifier as cc
import logic.identifyBloodGroup as lbg
import logic.identifyAges as la
import logic.identifyBloodPressure as lbp
answer=''

def chat(user_input):

    ######### Working on NER #######
    if v.checker["name"]==False:
        #here NER
        if ln.ner(user_input)==True:
            return answer
        return 'আপনাার নাম খুজে পাওয়া যাইনি। দয়া করে আবার বলুন।'

    ######### Working on Ages #######
    elif v.checker["age"]==False:
        if la.findAge(user_input)==True:
            return 'বয়স দেওয়ার জন্য আপনাকে ধন্যবাদ। আপনার রক্তের গ্রুপ বলুন।'

        return 'আপনার বয়স খুজে পাওয়া যাইনি। দয়া করে আবার বলুন।'

    ######### Working on Blood Group #######
    elif v.checker["blood group"]==False:
        if lbg.findBloodGroup(user_input)==True:
            return 'রক্তের গ্রুপ দেওয়ার জন্য আপনাকে ধন্যবাদ।\nআপনাকে কিভাবে সাহায্য করতে পারি?'

        return 'আপনার রক্তের গ্রুপ খুজে পাওয়া যাইনি।\nদয়া করে আবার বলুন।'

    ######### Working on Blood Pressure #######
    #elif v.checker["blood pressure"]==False:
    if re.match(r"((^আমার |^)(ব্লাড প্রেসার|রক্তচাপ))", user_input):
        if re.match(r".*( বলুন$| বলুন।$| কি$| কি?| দিন$| দিন।$)", user_input):
            return "আপনার রক্তচাপ "+v.info_map["blood pressure"]+" ।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
        if lbp.findBloodPressure(user_input)==True:
            return v.answer#'ব্লাড প্রেসার দেওয়ার জন্য আপনাকে ধন্যবাদ।\nআপনাকে কিভাবে সাহায্য করতে পারি?'

        return 'আপনার রক্তচাপ খুজে পাওয়া যাইনি। দয়া করে আবার বলুন।'

    ######### Working on Symptom #######
    elif v.checker["symptom"]==False:


        if re.match(r"(^|.* )(না|নাই|নেই)( .*|$|।)", user_input):
            if v.symptom_counter>=3:
                v.checker["symptom"]=True
                specialist=cc.classify()
                return 'আপনি আপনার এই সমস্যার জন্য '+specialist+' ডাক্তার দেখাতে পারেন।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?' ##classification is perform here
            return 'আপনাকে সর্বনিমন তিনটি উপসর্গ বলতে হবে। তাহলেই আমরা আপনাকে পরামর্শ দিতে পারবো।'

        #counter=v.symptom_counter
        if ls.similarity(user_input)==True:

            if v.symptom_counter>=3:
                return answer+"আরও নতুন উপসর্গ থাকলে লিখুন। না থাকলে না বলুন।"
            return answer+'আরেকটা উপসর্গ বলুন।'



        if v.symptom_counter>=3:
            return 'আপনার উপসর্গটি খুজে পাওয়া যায়নি। আরও থাকলে লিখুন। না থাকলে না বলুন।'

        return 'আপনার উপসর্গটি খুজে পাওয়া যায়নি। আরেকটা নতুন উপসর্গ বলুন'


    ######### Working on Symtops #######
    if re.match(r"(^|.* )(বেথা|সমস্যা|সমস্যায়|প্রবলেম|প্রবলেমে|ভাল নেই)(.*|$|।)", user_input):
        #v.symptomMatrix=np.zeros([1,132])
        if v.checker["already identify disease"]==True:
            return "আমরা আপনাকে যে বিশেষজ্ঞ ডাক্তার পরামর্শ  দিয়েছি তার কাছে যান। আশা করি আপনার সমস্যা গুলো অতি আল্প সময়ের মাঝে ঠিক হয়ে যাবে।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
        v.checker["symptom"]=False
        return "আপনার সমস্যা গুলো এক এক করে বলুন\nতাহলে আমরা আপনাকে ভাল দিক নির্দেশনা দিতে পারবো"


    if re.match(r"আমার নাম( বলুন| কি| ?)", user_input):
        return "আপনার নাম "+v.info_map["name"]+" ।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
    elif re.match(r"আমার বয়স( বলুন| কি| ?)", user_input):
        return "আপনার বয়স "+v.info_map["age"]+" বছর ।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
    elif re.match(r"আমার ব্লাড গ্রুপ( বলুন| কি| ?)", user_input):
        return "আপনার ব্লাড গ্রুপ "+v.info_map["blood group"]+" ।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
    #elif re.match(r"আমার ব্লাড প্রেসার( বলুন| কি| ?)", user_input):
     #   return "আপনার ব্লাড প্রেসার "+v.info_map["blood pressure"]+" ।\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"
    elif re.match(r"আমার (সর্বশেষ |শেষ |বর্তমান |এখনকার | )তথ্য দিন(।|$)", user_input):
        return "নাম : "+v.info_map["name"]+"\nবয়স : "+v.info_map["age"]+"\nব্লাড গ্রুপ : "+v.info_map["blood group"]+"\nব্লাড প্রেসার : "+v.info_map["blood pressure"] +"\nআপনাকে আর কিভাবে সাহায্য করতে পারি?"

    if re.match(r"নতুন ভাবে রোগ নির্ণয় করুন( *|$)", user_input) or re.match(r"(^|^আমার )রোগ নির্ণয় করুন( *|$|।)", user_input):
        v.symptomMatrix=np.zeros([1,132])
        v.symptom_counter=0
        v.checker["symptom"]=False
        return "আপনার সমস্যা গুলো এক এক করে বলুন\nতাহলে আমরা আপনাকে ভাল দিক নির্দেশনা দিতে পারবো"


    #if user_input in ['*ধন্যবাদ*', 'আপনাকে ধন্যবাদ']:
     #   return 'আপনাকে কিভাবে সাহায্য করতে পারি?\n'
    if re.match(r"[\u0980-\u09FF। ]*ধন্যবাদ[\u0980-\u09FF। ]*", user_input):
        return ('আপনাকে আর কিভাবে সাহায্য করতে পারি?')

    elif user_input in ['হাই']:
        return 'হাই\nআপনাকে কিভাবে সাহায্য করতে পারি?\n'




######### Working for Name #######

    elif re.match(r"(^|.* )নাম( .*|$)", user_input):
        if re.match(r"(^|.* )(তোমার|তুমার|আপনার|তোর|কি)( .*|$|/?)", user_input) :
            return 'আমার নাম চ্যাটবট, আমাকে তৈরি করেছে Team-Explore.\nআপনাকে কিভাবে সাহায্য করতে পারি?\n'
        else:
            return "NR area"



    elif re.match(r"(^|.* )(তুমি|আপনি|তুই) কে( .*|$|/?)",user_input) :
        return 'আমার নাম চ্যাটবট, আমাকে তৈরি করেছে Team-Explore.\nআপনাকে কিভাবে সাহায্য করতে পারি?\n'
    #আমি আসলে জানতে চাচ্ছি কে আপনি?

    elif re.match(r"(^|.* )কে (তুমি|আপনি|তুই)( .*|$|/?)",user_input) :
        return 'আমার নাম চ্যাটবট, আমাকে তৈরি করেছে Team-Explore.\nআপনাকে কিভাবে সাহায্য করতে পারি?\n'


    elif re.match(r"(^|.* )(কাজ|উদ্দেশ্য) কি( .*|$|/?)", user_input):
        return 'আমার কাজ আপনাদের প্রশ্নের উত্তর  দেয়া ।\n'

    #elif user_input in ['তোমার কাজ কি', 'তোমার উদ্দেশ্য কি']:
        #return 'আমার কাজ আপনাদের প্রশ্নের উত্তর  দেয়া ।\n'

    elif re.match(r"(^|.* )কি (কর|করিস|করতেছো)( .*|$|/?)", user_input):
        return 'আমি তোমার সাথে চ্যাট করছি। তুমি কি করো ?\n'

    #elif user_input in ['তুমি কি কর', 'তুই কি করিস', 'কি করিস', 'কি করিস তুই']:
     #   return 'আমি তোমার সাথে চ্যাট করছি। তুমি কি করো ?\n'

    elif re.match(r".* (করছি|করি|করতেছি|)(।|$|,)", user_input):
        return 'শুনে ভালো লাগলো।\nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    #elif user_input in ['আমিও তোমার সাথে চ্যাট করছি', 'আমিও আপনার সাথে চ্যাট করছি', 'চ্যাট করছি']:
        #return 'শুনে ভালো লাগলো। আচ্ছা তুমি শুধু আমার সাথেই চ্যাট করছো ?\n'

    elif user_input in ['হুম', 'সত্যি', 'ঠিক বলেছো', 'ঠিক ধরেছো']:
        return 'নিজেকে ভাজ্ঞমান মনে করছি। তোমাকে আর কিভাবে সাহায্যও করতে পারি?\n'

    elif user_input in ['তাই বুঝি', 'তাই বুজি', 'আপনি কি কি করতে পারবেন ?']:
        return 'সত্যি বলছি আপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['তুমি কি খাও','তুমি কি খেতে পাছন্দ কর','তোমার পছন্দনিয়ো খাবার কি','তুমি কি আমাদের মত খেতে পারো']:
         return 'দুঃখিত আমি সুধু মাত্র একটি প্রোগ্রাম, যে খেতে পারেনা । তবে কম্পিউটার "RAM" আমার অনেক পাছন্দের জিনিস ।\n'

    elif user_input in ['তাই বুঝি', 'তাই বুজি', 'আপনি কি কি করতে পারবেন ?']:
         return 'সত্যি বলছি আপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['আজ কি বার', 'কি বার', 'আজকে কি বার']:
        day = datetime.date.today()
        day_no = day.weekday()
        if day_no == 0:
            return 'আজ সোমবার\n'
        elif day_no == 1:
            return 'আজ মঙ্গলবার\n'
        elif day_no == 2:
            return 'আজ বুধবার\n'
        elif day_no == 3:
            return 'আজ বৃহস্পতিবার\n'
        elif day_no == 4:
            return 'আজ শুক্রবার\n'
        elif day_no == 5:
            return 'আজ শনিবার\n'
        elif day_no == 6:
            return 'আজ রবিবার\n'

    elif user_input in ["এইটা কতো সাল", "এইটা কতো সাল?", "কতো সাল চলে", "কতো সাল চলে?", "সময় কতো", "এখন কইটা বাজে",
                        "এখন কইটা বাজে"]:
        now = datetime.datetime.now()
        current_year_time = now.strftime("%Y-%m-%d %H:%M")
        bangla_current_year_time = bangla.convert_english_digit_to_bangla_digit(current_year_time)
        return "সাল= " + bangla_current_year_time + " = সময়\n"

    elif re.match(r"(^|.* )কেমন (আছ|আছো|আছেন|আছিস)( .*|$|/?)", user_input) :#or re.match(r"(^|.* )ভাল (আছ|আছো|আছেন|আছিস)( .*|$|/?)", user_input) or re.match(r"(^|.* )তুই কে( .*|$|/?)",user_input) :
        return 'আমি ভাল আছি। \nআপনি কেমন আছেন?'

    #elif re.match(r"(^|.* )ভাল( আছি.*|$| ।| ,| ;|।|,|;)", user_input) :
        #return 'আমি ভাল আছি। \nআপনি কেমন আছেন?'
    elif re.match(r"(^|.* )ভাল( .*|আছি|$)", user_input) :
        if re.match(r"(^|.* )(না|নাই)( .*|$)", user_input) :
            return 'দুঃখিত ।\nআপনাকে কিভাবে সাহায্য করতে পারি?\n?'
        return 'শুনে খুসি হলাম। \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    #elif user_input in ['তুমি কেমন আছ', 'কেমন আছো', 'আপনি কেমন আছেন', 'ভাল আছো', 'কি খবর', 'কেমন আছিস']:
     #   return 'আমি ভাল আছি। তুমি কেমন আছো ?\n'

    #elif user_input in ['ভালো আছি', 'ভালো']:
     #   return 'শুনে খুসি হলাম। তোমাকে কিভাবে সাহায্য করতে পারি ?\n'

    elif user_input in ['তুমি কি মানুষ']:
        return 'না। আমি ভার্চুয়াল এজেন্ট।\n'

    elif user_input in ['বয়স কত', 'তোমার বয়স কত', 'আপনার বয়স কত', 'তোর বয়স কতো']:
        return 'আমার জন্ম দিন ২১ সে ফেব্রুয়ারি \n'

    elif user_input in ['তুমি ছেলে না মেয়ে', 'তুমি কি ছেলে', 'তুমি কি মেয়ে', 'তুই কি ছেলে', 'তুই কি মেয়ে']:
        return 'আমি একটি চ্যাটবট।\n'

    elif user_input in ['তুই ফালতু', 'তুমি ফালতু', 'বাল', ]:
        return "মুখ সামলে কথা বলুন, আমি জানি আপনি অনেক সুন্দর করে কথা বলতে পারেন।\n"

    elif user_input in ['এই টা খুবি ফালতু হয়েছে', 'কাজ করে না', 'কি সব করে রাখসে']:
        return "Team-Explore চেষ্টা করবে আমাকে আরো আধুনিক করার।\n"

    elif user_input in ['তুমি কি রোবট', 'তুমি কি']:
        return 'আমি একটি চ্যাটবট।\n'

    elif user_input in ['তুমি কোথায় থাক', 'তোমার বাসা কই', 'তোমার ঠিকানা কি']:
        return 'আমি কম্পিউটার প্রোগ্রাম এ থাকি\n'

    elif user_input in ['exit', 'ভাল থাকবেন', 'বিদায়', 'আল্লাহাফেজ']:
        return 'বিদায়।\n'

    elif user_input in ['দুর হও', 'আমি আর তোমার সাথে কথা বলতে চাই না', 'বন্দো হয়ে যাও']:
        return 'ভালো থাকবেন।\n'

    ###############

    elif user_input in ['এখানকার ডাক্তার গুলো অনেক ভালো ', 'ডাক্তার গুলো অনেক ভালো  ',  'ডাক্তার গুলোর ব্যবহার অনেক ভালো' ]:
        return 'আপনাকে ধন্যবাদ \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'
    elif user_input in [ 'ডাক্তার ভালো', 'ডাক্তার ভালো ব্যবহার করে', 'ডাক্তার ভালো ব্যবহার করেছে ', 'ডাক্তারের ব্যবহার সুন্দর ']:
        return 'আপনাকে ধন্যবাদ \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ডাক্তারের ব্যবহার ভালো না', 'ডাক্তার ভালো ব্যবহার করে না', 'ডাক্তার ভালো ব্যবহার করেনি', 'ডাক্তারের ব্যবহার সুন্দর হওয়া দরকার ' ]:
            return 'আপনার অভিযোগটি গুরুত্বের সাথে গ্রহণ করা হলো । \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ডাক্তার আমাকে কম সময় দিয়েছে', 'ডাক্তারের মাথা গরম বেশি থাকে', 'ডাক্তার খারাপ মানুষ', 'ডাক্তার বেশি কথা বলে ' ]:
            return 'আপনার অভিযোগটি গুরুত্বের সাথে গ্রহণ করা হলো । \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ডাক্তারের ফি আমাকে বেশি ', 'ডাক্তার বদমেজাজি', 'ডাক্তার খারাপ মানুষ', 'ডাক্তার বেশি কথা বলে ',   'ডাক্তার খুব খারাপ',  'ভালো না',  'ডাক্তার ভালো না',  'ডাক্তার বেশি টাকা নেই']:
            return 'আপনার অভিযোগটি গুরুত্বের সাথে গ্রহণ করা হলো । \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'হসপিটাল ফি আমাকে বেশি ', 'হাসপাতালের ফী অনেক বেশি', 'হাসপাতাল ভালো না', 'হসপিটাল ভালো না']:
            return 'আপনার অভিযোগটি গুরুত্বের সাথে গ্রহণ করা হলো । \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'


    elif user_input in [ 'আপনাদের এইখানে কি কি পরীক্ষা করা যায়', 'আপনাদের এইখানে কি কি টেস্ট করা যায় ', 'আমি এখানে টেস্ট করাতে চাই']:
            return 'আমাদের ডায়গনিস্টিক সেবা গুলো হচ্ছেঃ \nএচোকার্ডিওগ্রাম( ECHOCARDIOGRAM ) \nইউ এস জি( USG ) \nএম আর আই( MRI ) \nকলোনোস্কোপি( CLONOSCOPY ) \nই সি জি( ECG ) \nএন্ডোস্কোপি( ENDOSCOPY ) \nএক্সরে( XRAY ) \nসিটি স্ক্যান( CT SCAN  ) \nই ই জ( EEG ) \nদাঁতের এক্সরে( DENTAL XRAY ) আমাদের এই ধরনের অনেক সেবা আছে অনুগ্রহ করে ৩নং কাউন্টারে যোগাযোগ করুন \nআপনাকে কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['এ্যাম্বুলেন্সের খোজ নিতে চাচ্ছি', 'এ্যাম্বুলেন্সের নাম্বার লাগবে', 'এ্যাম্বুলেন্সের মোবাইল নাম্বার লাগবে' , 'আপনাদের এ্যাম্বুলেন্স আছে', 'এ্যাম্বুলেন্স নিতে চাই', 'এ্যাম্বুলেন্সের ভারা কতো?', 'এ্যাম্বুলেন্সের ভারা কতো']:
        return 'দয়া করে ৩নং কাউন্টারে যোগাযোগ করুন অথবা ০১৫২১৪৮১৬৫৮ এই মোবাইল নাম্বারে যোগাযোগ করুন। \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['৩নং কাউন্টার কথায়?', '৩নং কাউন্টার কথায়']:
        return 'আপনি ১তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['১০১নং রুম কথায়?', '১০২নং রুম কথায়?', '৩নং রুম কথায়?', '১০৪নং রুম কথায়?', '১০৫নং রুম কথায়?', '১০৬নং রুম কথায়?', '১০৭নং রুম কথায়?', '১০৮নং রুম কথায়?', '১০৯নং রুম কথায়?']:
        return 'আপনি ১তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['২০১নং রুম কথায়?', '২০২নং রুম কথায়?', '২০৩নং রুম কথায়?', '২০৪নং রুম কথায়?', '২০৫নং রুম কথায়?', '২০৬নং রুম কথায়?', '২০৭নং রুম কথায়?', '২০৮নং রুম কথায়?', '১০৯নং রুম কথায়?']:
            return 'আপনি ২ তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['৩০১নং রুম কথায়?', '৩০২নং রুম কথায়?', '৩০৩নং রুম কথায়?', '৩০৪নং রুম কথায়?', '৩০৫নং রুম কথায়?', '৩০৬নং রুম কথায়?', '৩০৭নং রুম কথায়?', '৩০৮নং রুম কথায়?', '৩০৯নং রুম কথায়?']:
            return 'আপনি ৩ তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['৪০১নং রুম কথায়?', '৪০২নং রুম কথায়?', '৪০৩নং রুম কথায়?', '৪০৪নং রুম কথায়?', '৪০৫নং রুম কথায়?', '৪০৬নং রুম কথায়?', '৪০৭নং রুম কথায়?', '৪০৮নং রুম কথায়?', '৪০৯নং রুম কথায়?']:
            return 'আপনি ৪তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['৫০১নং রুম কথায়?', '৫০২নং রুম কথায়?', '৫০৩নং রুম কথায়?', '৫০৪নং রুম কথায়?', '৫০৫নং রুম কথায়?', '৫০৬নং রুম কথায়?', '৫০৭নং রুম কথায়?', '৫০৮নং রুম কথায়?', '৫০৯নং রুম কথায়?']:
            return 'আপনি ৫তলাতে যান \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'


    elif user_input in ['নামাজ ঘর কথায়?', 'নামাজ ঘর কথায়', 'আমাকে কি বলতে পারবেন নামাজ ঘর কথায়?', 'নামাজ ঘর টি কথায় জানতে চাচ্ছিলাম', 'নামাজ ঘরে জেতে চাই', 'নামাজ পরতে চাই']:
            return 'আমাদের এখানে নামাজ ঘরটি ৫০৩নং রুমে, আপনি ৫ তলায় যান। \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['হাসপাতাল কখন বন্ধ হবে?', 'হাসপাতাল কখন বন্ধ হয়?', 'হাসপাতাল কখন বন্ধ হয়', 'হসপিটাল কখন বন্ধ হয়', 'হসপিটাল কখন বন্ধ হয়?']:
            return 'আমাদের ২৪ ঘণ্টাই খোলা থাকে। \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['কাউন্টার কখন খুলবে?', 'কাউন্টার কখন খুলবে', 'কাউন্টার কখন বন্ধ হবে?', 'কাউন্টার কখন বন্ধ হয়', 'কাউন্টার কখন বন্ধ হয়?']:
            return 'সকাল ৯ টা থেকে রাত ১১ টা পর্যন্ত খোলা থাকে। \nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['আমি আমার রিপোর্ট গুলো কখন পাবো?', 'আমি আমার রিপোর্ট গুলো কখন পাবো', 'রিপোর্ট কখন দিবে?', 'রিপোর্ট কখন দিবে?', 'রিপোর্ট কোথায় দিবে?', 'রিপোর্ট কোথায় দিবে']:
            return 'রিপোর্ট সংগ্রহের জন্য আপনি ৪নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['আমি ডাক্তারের সিরিয়াল দিতে চাই?', 'আমি ডাক্তারের সিরিয়াল দিতে চাই', 'আমি ডাক্তার দেখাতে চাই?', 'আমি ডাক্তার দেখাতে চাই', 'ডাক্তারের সিরিয়াল কোথায় দিব?', 'ডাক্তারের সিরিয়াল কোথায় দিব','ডাক্তারের সিরিয়াল দিতে চাই?','ডাক্তারের সিরিয়াল দিতে চাই','ডাক্তারের সিরিয়াল দিব কোথায়?','ডাক্তারের সিরিয়াল দিব কোথায়']:
            return 'ডাক্তারের সিরিয়ালের জন্য ১নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['হাসপাতালে ভর্তি করাতে চাই?', 'হাসপাতালে ভর্তি করাতে চাই', 'হসপিটালে ভর্তি করাতে চাই?', 'হসপিটালে ভর্তি করাতে চাই', 'কোথায় রুগিকে ভর্তি করাবো?', 'কোথায় রুগিকে ভর্তি করাবো','কোথায় রোগীকে ভর্তি করাবো']:
            return 'রোগীকে ভর্তি করানোর জন্য ২নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['রিপোর্ট কখন দিবে?', 'রিপোর্ট কখন দিবে', 'রিপোর্ট কখন পাবো?', 'রিপোর্ট কখন পাবো', 'রিপোর্ট কোথায় পাবো?', 'রিপোর্ট কোথায় পাবো','রিপোর্ট কবে দিবে?','রিপোর্ট কবে দিবে']:
            return 'রিপোর্ট সংক্রান্ত যাবতীয় কাজের জন্য  ৪নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['টেস্ট করাতে কত সময় লাগবে?', 'টেস্ট করাতে কত সময় লাগবে', 'রিপোর্ট কবে দিবে?', 'রিপোর্ট কবে দিবে']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in ['টেস্ট করাতে কত সময় লাগবে?', 'টেস্ট করাতে কত সময় লাগবে', 'রিপোর্ট কবে দিবে?', 'রিপোর্ট কবে দিবে']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ইউ এস জি টেস্ট করাতে কত টাকা লাগবে?', 'ইউ এস জি টেস্ট করাতে কত টাকা লাগবে', 'USG টেস্ট করাতে কত টাকা লাগবে' , 'USG টেস্ট করাতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'এম আর আই করতে কত টাকা লাগবে?', 'এম আর আই টেস্ট করাতে কত টাকা লাগবে?' , 'এম আর আই টেস্ট করাতে কত টাকা লাগবে', 'MRI টেস্ট করাতে কত টাকা লাগবে' , 'MRI টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'কলোনোস্কোপি করতে কত টাকা লাগবে?', 'কলোনোস্কোপি টেস্ট করাতে কত টাকা লাগবে?' , 'কলোনোস্কোপি টেস্ট করাতে কত টাকা লাগবে', 'CLONOSCOPY টেস্ট করাতে কত টাকা লাগবে' , 'CLONOSCOPY টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ই সি জি করতে কত টাকা লাগবে?', 'ই সি জি টেস্ট করাতে কত টাকা লাগবে?' , 'ই সি জি টেস্ট করাতে কত টাকা লাগবে', 'ECG টেস্ট করাতে কত টাকা লাগবে' , 'ECG টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'এন্ডোস্কোপি করতে কত টাকা লাগবে?', 'এন্ডোস্কোপি টেস্ট করাতে কত টাকা লাগবে?' , 'এন্ডোস্কোপি টেস্ট করাতে কত টাকা লাগবে', 'ENDOSCOPY টেস্ট করাতে কত টাকা লাগবে' , 'ENDOSCOPY টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'



    elif user_input in [ 'এক্সরে করতে কত টাকা লাগবে?', 'এক্সরে টেস্ট করাতে কত টাকা লাগবে?' , 'এক্সরে টেস্ট করাতে কত টাকা লাগবে', 'XRAY টেস্ট করাতে কত টাকা লাগবে' , 'XRAY টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'সিটি স্ক্যান করতে কত টাকা লাগবে?', 'সিটি স্ক্যান টেস্ট করাতে কত টাকা লাগবে?' , 'সিটি স্ক্যান টেস্ট করাতে কত টাকা লাগবে', 'CT SCAN টেস্ট করাতে কত টাকা লাগবে' , 'CT SCAN টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'ই ই জ করতে কত টাকা লাগবে?', 'ই ই জ টেস্ট করাতে কত টাকা লাগবে?' , 'ই ই জ টেস্ট করাতে কত টাকা লাগবে', 'EEG টেস্ট করাতে কত টাকা লাগবে' , 'EEG টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'দাঁতের এক্সরে করতে কত টাকা লাগবে?', 'দাঁতের এক্সরে টেস্ট করাতে কত টাকা লাগবে?' , 'দাঁতের এক্সরে টেস্ট করাতে কত টাকা লাগবে', 'DENTAL XRAY টেস্ট করাতে কত টাকা লাগবে' , 'DENTAL XRAY টেস্ট করতে কত টাকা লাগবে?']:
            return 'আপনি  ৩নং কাউন্টারে যোগাযোগ করুন\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'

    elif user_input in [ 'রোগীর সিরিয়াল কি মোবাইললে দেওয়া হায়?', 'রোগীর সিরিয়াল কি মোবাইললে দেওয়া হায়' , 'আপনার মোবাইল নাম্বারটি দিন', 'আপনার ফোন নাম্বারটি দিন' , 'আপনাদের মোবাইল নাম্বারটি দিন']:
            return 'আমাদের হট লাইন নাম্বার ০১৫২১-৪৮১৬৪৮\nআপনাকে আর কিভাবে সাহায্য করতে পারি?\n'


    ##############

    else:
        rand = random.randint(0, 4)

        if rand == 0:
            return 'দুঃখিত। বুঝতে পারি নি। অন্য কিছ জিজ্ঞেস করুন।\n'

        elif rand == 1:
            return 'দুঃখিত। মাথার উপর দিয়ে গেছে । আরেকবার জিজ্ঞেস করুন\n'

        elif rand == 2:
            return 'দুঃখিত । আরেকবার জিজ্ঞেস করুন\n'

        elif rand == 3:
            return 'দুঃখিত । আমার প্রোগ্রাম আপনার কথা বুঝছেনা । আনুগ্রহ পুরবক অন্য কিছ জিজ্ঞেস করুন ।\n'

        else:
            return 'দুঃখিত । এইটা আমার জ্ঞান এর বাইরে  । আনুগ্রহ পুরবক অন্য কিছু জিজ্ঞেস করুন।\n'
